src/it/pci.org
#+TITLE: Patterns di Computazione Iterativa
#+AUTHOR: Jacopo Costantini

