docs/it/pci.html
<!doctype html>
<html lang="en">
<head>
<title>Patterns di Computazione Iterativa</title>
<!-- 2022-01-22 Sat 10:49 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<meta name="generator" content="Org-mode">
<meta name="author" content="Jacopo Costantini">

<link  href="https://cdnjs.cloudflare.com/ajax/libs/twitter-bootstrap/3.3.5/css/bootstrap.min.css" rel="stylesheet">

</head>
<body>
<div id="content" class="container">
<div class="row"><div class="col-md-3 col-md-push-9"><nav id="table-of-contents">
<div id="text-table-of-contents" class="bs-docs-sidebar">
<ul class="nav">
<li><a href="#sec-1">1. Accumulo di valori numerici e di valori logici</a></li>
<li><a href="#sec-2">2. Ricerca con filtro</a></li>
</ul>
</div>
</nav>
</div><div class="col-md-9 col-md-pull-3"><h1 class="title">Patterns di Computazione Iterativa</h1>
