docs/it/pci.html

<div id="outline-container-sec-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Accumulo di valori numerici e di valori logici</h2>
<div class="outline-text-2" id="text-1">
<p>
Consideriamo il seguente esercizio: dato un array di interi \(x=\{10,20,30,40,50,60\}\), calcolare la somma dei suoi elementi.
</p>

<p>
La somma è una tipica operazione che gode della proprietà associativa, e cioè è vero che \((a+b)+c=a+(b+c)\), che ne nostro esempio ci consente di scrivere:
</p>

<p>
\[10+20+30+40+50+60=((((((10)+20)+30)+40)+50)+60)\]
</p>

<p>
Per calcolare la somma degli elementi dell’intera sequenza possiamo calcolare la somma parziale al primo all’*i‐esimo* elemento e poi aggiungere l’elemento in posizione <b>i + 1</b>. A questo scopo, useremo una variabile accumulatore per memorizzare di volta in volta la somma parziale, incrementandola man mano che processiamo gli elementi della lista.
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdio.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">somma</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">v</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v_size</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">accum</span> = <span style="color: #465953; background-color: #d2ebe3;">0</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">0</span>; i &lt; v_size; ++i<span style="color: #9c739c;">)</span>
        accum += v<span style="color: #9c739c;">[</span>i<span style="color: #9c739c;">]</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> accum;
<span style="color: #7382a0;">}</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">x</span><span style="color: #9c739c;">[]</span> = <span style="color: #9c739c;">{</span><span style="color: #465953; background-color: #d2ebe3;">10</span>,<span style="color: #465953; background-color: #d2ebe3;">20</span>,<span style="color: #465953; background-color: #d2ebe3;">30</span>,<span style="color: #465953; background-color: #d2ebe3;">40</span>,<span style="color: #465953; background-color: #d2ebe3;">50</span>,<span style="color: #465953; background-color: #d2ebe3;">60</span><span style="color: #9c739c;">}</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">s</span> = somma<span style="color: #9c739c;">(</span>x, <span style="color: #465953; background-color: #d2ebe3;">6</span><span style="color: #9c739c;">)</span>;
    printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"%d"</span>, s<span style="color: #9c739c;">)</span>;

    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>
</pre>
</div>

<pre class="example">
210
</pre>



<p>
Questo pattern si applica a diverse operazioni: <b>prodotto, media, minimo, massimo, and logico, or logico, etc.</b>
E’ importante inizializzare in maniera corretta la variabile accumulatore, in modo da avere un valore neutro rispetto all’operazione da eseguire (ad es. per il calcolo del prodotto dovrò inizializzare con valore 1) e per avere un valore valido anche nel caso in cui il ciclo non venga mai eseguito (non possiamo sapere infatti quale sarà l’input).
Proviamo lo stesso esempio per la ricerca del minimo. Possiamo infatti scrivere che:
</p>

<p>
\[min(10+20+30+40+50+60)=min(min(min(min(min(min(10)+20)+30)+40)+50)+60)\]
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdio.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>
<span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdlib.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">min</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">b</span><span style="color: #7382a0;">)</span> <span style="color: #b9a992;">/*</span><span style="color: #b9a992;">func min</span><span style="color: #b9a992;">*/</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span>a &lt; b<span style="color: #9c739c;">)</span> <span style="color: #614c61; background-color: #f1ddf1;">return</span> a;
    <span style="color: #614c61; background-color: #f1ddf1;">else</span> <span style="color: #614c61; background-color: #f1ddf1;">return</span> b;
<span style="color: #7382a0;">}</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">minimo</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span> *<span style="color: #4c5361; background-color: #dde4f2;">v</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v_size</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>, <span style="color: #4c5361; background-color: #dde4f2;">accum</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span>v_size &lt;= <span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">)</span> exit<span style="color: #9c739c;">(</span><span style="color: #465953; background-color: #d2ebe3;">EXIT_FAILURE</span><span style="color: #9c739c;">)</span>; <span style="color: #b9a992;">/*</span><span style="color: #b9a992;">controllo dell'input</span><span style="color: #b9a992;">*/</span>
    accum = v<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">]</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">0</span>; i &lt; v_size; ++i<span style="color: #9c739c;">)</span>
        accum = min<span style="color: #9c739c;">(</span>v<span style="color: #81895d;">[</span>i<span style="color: #81895d;">]</span>, accum<span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> accum;
<span style="color: #7382a0;">}</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">x</span><span style="color: #9c739c;">[]</span> = <span style="color: #9c739c;">{</span><span style="color: #465953; background-color: #d2ebe3;">10</span>,<span style="color: #465953; background-color: #d2ebe3;">20</span>,<span style="color: #465953; background-color: #d2ebe3;">30</span>,<span style="color: #465953; background-color: #d2ebe3;">40</span>,<span style="color: #465953; background-color: #d2ebe3;">50</span>,<span style="color: #465953; background-color: #d2ebe3;">60</span><span style="color: #9c739c;">}</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">s</span> = minimo<span style="color: #9c739c;">(</span>x, <span style="color: #465953; background-color: #d2ebe3;">6</span><span style="color: #9c739c;">)</span>;
    printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"%d"</span>, s<span style="color: #9c739c;">)</span>;

    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>
</pre>
</div>

<pre class="example">
10
</pre>



<p>
Nell’esempio sopra, l’accumulatore viene inizializzato con il primo elemento del vettore. Questa soluzione è da preferire all’inizializzazione con costanti, e vi eviterà errori banali quali inizializzare con 0 in cerca del massimo per poi ricevere un input con valori anche negativi. Abbiamo però aggiunto un controllo sulla lunghezza del vettore in input per essere sicuri che ci sia un primo elemento. Un modo comune di implementare queste funzioni dove è possibile avere degli errori è quello di usare un parametro aggiuntivo di tipo puntatore da aggiornare con il risultato (nell’esempio avremmo un <b>int*</b> accum) e di ritornare 1 in caso di successo e 0 in caso di errore.
</p>

<p>
Lo stesso pattern vale per la congiunzione o disgiunzione di proposizioni logiche, come ad esempio
controllare che tutti i numeri della sequenza in input siano pari.
</p>


<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdio.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>
<span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdlib.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">pari</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">v</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v_size</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>, <span style="color: #4c5361; background-color: #dde4f2;">accum</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span>v_size &lt;= <span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">)</span> exit<span style="color: #9c739c;">(</span><span style="color: #465953; background-color: #d2ebe3;">EXIT_FAILURE</span><span style="color: #9c739c;">)</span>;
    accum = v<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">]</span>%<span style="color: #465953; background-color: #d2ebe3;">2</span> == <span style="color: #465953; background-color: #d2ebe3;">0</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">1</span>; i &lt; v_size; ++i<span style="color: #9c739c;">)</span>
        accum = accum &amp;&amp; <span style="color: #9c739c;">(</span>v<span style="color: #81895d;">[</span>i<span style="color: #81895d;">]</span>%<span style="color: #465953; background-color: #d2ebe3;">2</span> == <span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> accum;
<span style="color: #7382a0;">}</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">x</span><span style="color: #9c739c;">[]</span> = <span style="color: #9c739c;">{</span><span style="color: #465953; background-color: #d2ebe3;">11</span>,<span style="color: #465953; background-color: #d2ebe3;">22</span>,<span style="color: #465953; background-color: #d2ebe3;">33</span>,<span style="color: #465953; background-color: #d2ebe3;">44</span>,<span style="color: #465953; background-color: #d2ebe3;">55</span>,<span style="color: #465953; background-color: #d2ebe3;">66</span><span style="color: #9c739c;">}</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">s</span> = pari<span style="color: #9c739c;">(</span>x, <span style="color: #465953; background-color: #d2ebe3;">6</span><span style="color: #9c739c;">)</span>;
    printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"%d"</span>, s<span style="color: #9c739c;">)</span>;

    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>
</pre>
</div>

<pre class="example">
0
</pre>


<p>
Nota:
</p>
<blockquote>
<p>
Non appena incontriamo un valore falso possiamo smettere la visita del vettore, perchè un valore falso in and logico con un altro valore restituirà sempre un valore falso.
</p>
</blockquote>

<p>
Possiamo riscrivere il codice come segue.
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdio.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>
<span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdlib.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">pari</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">v</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v_size</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>, <span style="color: #4c5361; background-color: #dde4f2;">accum</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span>v_size &lt;= <span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">)</span> exit<span style="color: #9c739c;">(</span><span style="color: #465953; background-color: #d2ebe3;">EXIT_FAILURE</span><span style="color: #9c739c;">)</span>;
    accum = v<span style="color: #9c739c;">[</span><span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">]</span>%<span style="color: #465953; background-color: #d2ebe3;">2</span> == <span style="color: #465953; background-color: #d2ebe3;">0</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">1</span>; accum &amp;&amp; i &lt; v_size; ++i<span style="color: #9c739c;">)</span>
        accum = accum &amp;&amp; <span style="color: #9c739c;">(</span>v<span style="color: #81895d;">[</span>i<span style="color: #81895d;">]</span>%<span style="color: #465953; background-color: #d2ebe3;">2</span> == <span style="color: #465953; background-color: #d2ebe3;">0</span><span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> accum;
<span style="color: #7382a0;">}</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">x</span><span style="color: #9c739c;">[]</span> = <span style="color: #9c739c;">{</span><span style="color: #465953; background-color: #d2ebe3;">11</span>,<span style="color: #465953; background-color: #d2ebe3;">22</span>,<span style="color: #465953; background-color: #d2ebe3;">33</span>,<span style="color: #465953; background-color: #d2ebe3;">44</span>,<span style="color: #465953; background-color: #d2ebe3;">55</span>,<span style="color: #465953; background-color: #d2ebe3;">66</span><span style="color: #9c739c;">}</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">s</span> = pari<span style="color: #9c739c;">(</span>x, <span style="color: #465953; background-color: #d2ebe3;">6</span><span style="color: #9c739c;">)</span>;
    printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"%d"</span>, s<span style="color: #9c739c;">)</span>;

    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>
</pre>
</div>

<pre class="example">
0
</pre>


<p>
Nell’esempio sopra, non sarà eseguita nemmeno una iterazione del ciclo.
</p>
</div>
</div>
