src/it/pci.org
* Ricerca con filtro

Consideriamo il seguente esercizio: dato un array di interi $x=\{10,20,30,40,50,60\}$, trovare il primo valore da sinistra maggiore di 35.
In questo caso è necessario scorrere tutti gli elementi del vettore, ma è possibile terminare in anticipo l’iterazione non appena l’elemento cercato viene trovato.

#+begin_src C -n 1 :exports both
#include <stdio.h>
#include <stdlib.h>

int find(int* v, int v_size, int* elem)
{
    int i;
    for(i = 0; i < v_size; ++i)
    {
        if(v[i] > 35)
        {
            ,*elem = v[i];
            return 1;
        }
    }
    return 0;
}

int main()
{
    int x[] = {10,20,30,40,50,60};
    int z;
    int found = find(x, 6, &z);
    if(found)
        printf("Trovato %d", z);
    else
        printf("Nessun elemento trovato");
    return 0;
}
#+end_src

#+RESULTS:
: Trovato 40

Nella soluzione abbiamo usato l’approccio di scrivere l’output (l’elemento trovato) usando il puntatore ricevuto come parametro, e di far restituire alla funzione il valore 1 o 0 in base all’esito della ricerca.
Non è quindi necessario scorrere sempre tutti gli elementi del vettore, Il comando return ha l’effetto immediato di terminare l’esecuzione della funzione. Se nell’esempio vengono completate tutte le iterazioni del ciclo for allora significa che non abbiamo mai trovato l’elemento cercato e possiamo quindi restituire il valore 0 per indicarne l’assenza.
I due pattern visti fino adesso possono essere presenti contemporaneamente. In questo caso l’inzializzazione dell’accumulatore deve essere fatta con attenzione, evitando di usare valori che non rispettano la proprietà del filtro.

Consideriamo l’esempio: dato un array di interi x={10,20,30,40,50,60}, calcolare il minimo degli elementi maggiori di 30.

#+begin_src C -n 1 :exports both
#include <stdio.h>
#include <stdlib.h>

int min(int a, int b)
{
    if(a < b) return a;
    else return b;
}
int minimo(int* v, int v_size, int* accum)
{
    int i;
    int found_at_least_one = 0;
    for(i = 0; i < v_size; ++i)
    {
        if(v[i] > 30)
        {
            if(!found_at_least_one)
            {
                *accum = v[i];
                found_at_least_one = 1;
            }
            else
            {
                *accum = min(*accum, v[i]);
            }
        }
    }
    return found_at_least_one;
}

int main()
{
    int x[] = {10,20,30,40,50,60};
    int z;
    int found = minimo(x, 6, &z);
    if(found)
        printf("Trovato %d", z);
    else
        printf("Nessun elemento trovato");
    return 0;
}
#+end_src

#+RESULTS:
: Trovato 40

Nota:
#+begin_quote
L’utilizzo del flag found_at_least_one per mantenere l’informazione di aver già trovato almeno un elemento che soddisfa il filtro.
#+end_quote


[[* Accumulo di valori numerici e di valori logici][[ TOP ]​]] [[file:ITlist.org][[ HOME ]​]]
