docs/it/pci.html

<div id="outline-container-sec-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> Ricerca con filtro</h2>
<div class="outline-text-2" id="text-2">
<p>
Consideriamo il seguente esercizio: dato un array di interi \(x=\{10,20,30,40,50,60\}\), trovare il primo valore da sinistra maggiore di 35.
In questo caso è necessario scorrere tutti gli elementi del vettore, ma è possibile terminare in anticipo l’iterazione non appena l’elemento cercato viene trovato.
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdio.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>
<span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdlib.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">find</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">v</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v_size</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">elem</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">0</span>; i &lt; v_size; ++i<span style="color: #9c739c;">)</span>
    <span style="color: #9c739c;">{</span>
        <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #81895d;">(</span>v<span style="color: #957f5f;">[</span>i<span style="color: #957f5f;">]</span> &gt; <span style="color: #465953; background-color: #d2ebe3;">35</span><span style="color: #81895d;">)</span>
        <span style="color: #81895d;">{</span>
            *elem = v<span style="color: #957f5f;">[</span>i<span style="color: #957f5f;">]</span>;
            <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">1</span>;
        <span style="color: #81895d;">}</span>
    <span style="color: #9c739c;">}</span>
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">x</span><span style="color: #9c739c;">[]</span> = <span style="color: #9c739c;">{</span><span style="color: #465953; background-color: #d2ebe3;">10</span>,<span style="color: #465953; background-color: #d2ebe3;">20</span>,<span style="color: #465953; background-color: #d2ebe3;">30</span>,<span style="color: #465953; background-color: #d2ebe3;">40</span>,<span style="color: #465953; background-color: #d2ebe3;">50</span>,<span style="color: #465953; background-color: #d2ebe3;">60</span><span style="color: #9c739c;">}</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">z</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">found</span> = find<span style="color: #9c739c;">(</span>x, <span style="color: #465953; background-color: #d2ebe3;">6</span>, &amp;z<span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span>found<span style="color: #9c739c;">)</span>
        printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Trovato %d"</span>, z<span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">else</span>
        printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Nessun elemento trovato"</span><span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>
</pre>
</div>

<pre class="example">
Trovato 40
</pre>


<p>
Nella soluzione abbiamo usato l’approccio di scrivere l’output (l’elemento trovato) usando il puntatore ricevuto come parametro, e di far restituire alla funzione il valore 1 o 0 in base all’esito della ricerca.
Non è quindi necessario scorrere sempre tutti gli elementi del vettore, Il comando return ha l’effetto immediato di terminare l’esecuzione della funzione. Se nell’esempio vengono completate tutte le iterazioni del ciclo for allora significa che non abbiamo mai trovato l’elemento cercato e possiamo quindi restituire il valore 0 per indicarne l’assenza.
I due pattern visti fino adesso possono essere presenti contemporaneamente. In questo caso l’inzializzazione dell’accumulatore deve essere fatta con attenzione, evitando di usare valori che non rispettano la proprietà del filtro.
</p>

<p>
Consideriamo l’esempio: dato un array di interi x={10,20,30,40,50,60}, calcolare il minimo degli elementi maggiori di 30.
</p>

<div class="org-src-container">

<pre class="src src-C"><span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdio.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>
<span style="color: #605a52; background-color: #f7f3ee;">#include</span> <span style="color: #7382a0; background-color: #e2e9c1;">&lt;</span><span style="color: #525643; background-color: #e2e9c1;">stdlib.h</span><span style="color: #7382a0; background-color: #e2e9c1;">&gt;</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">min</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">a</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">b</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span>a &lt; b<span style="color: #9c739c;">)</span> <span style="color: #614c61; background-color: #f1ddf1;">return</span> a;
    <span style="color: #614c61; background-color: #f1ddf1;">else</span> <span style="color: #614c61; background-color: #f1ddf1;">return</span> b;
<span style="color: #7382a0;">}</span>
<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">minimo</span><span style="color: #7382a0;">(</span><span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">v</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">v_size</span>, <span style="color: #605a52; background-color: #f7f3ee;">int</span>* <span style="color: #4c5361; background-color: #dde4f2;">accum</span><span style="color: #7382a0;">)</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">i</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">found_at_least_one</span> = <span style="color: #465953; background-color: #d2ebe3;">0</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">for</span><span style="color: #9c739c;">(</span>i = <span style="color: #465953; background-color: #d2ebe3;">0</span>; i &lt; v_size; ++i<span style="color: #9c739c;">)</span>
    <span style="color: #9c739c;">{</span>
        <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #81895d;">(</span>v<span style="color: #957f5f;">[</span>i<span style="color: #957f5f;">]</span> &gt; <span style="color: #465953; background-color: #d2ebe3;">30</span><span style="color: #81895d;">)</span>
        <span style="color: #81895d;">{</span>
            <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #957f5f;">(</span><span style="color: #605a52; background-color: #f7f3ee;">!</span>found_at_least_one<span style="color: #957f5f;">)</span>
            <span style="color: #957f5f;">{</span>
                *accum = v<span style="color: #7382a0;">[</span>i<span style="color: #7382a0;">]</span>;
                found_at_least_one = <span style="color: #465953; background-color: #d2ebe3;">1</span>;
            <span style="color: #957f5f;">}</span>
            <span style="color: #614c61; background-color: #f1ddf1;">else</span>
            <span style="color: #957f5f;">{</span>
                *accum = min<span style="color: #7382a0;">(</span>*accum, v<span style="color: #9c739c;">[</span>i<span style="color: #9c739c;">]</span><span style="color: #7382a0;">)</span>;
            <span style="color: #957f5f;">}</span>
        <span style="color: #81895d;">}</span>
    <span style="color: #9c739c;">}</span>
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> found_at_least_one;
<span style="color: #7382a0;">}</span>

<span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #605a52;">main</span><span style="color: #7382a0;">()</span>
<span style="color: #7382a0;">{</span>
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">x</span><span style="color: #9c739c;">[]</span> = <span style="color: #9c739c;">{</span><span style="color: #465953; background-color: #d2ebe3;">10</span>,<span style="color: #465953; background-color: #d2ebe3;">20</span>,<span style="color: #465953; background-color: #d2ebe3;">30</span>,<span style="color: #465953; background-color: #d2ebe3;">40</span>,<span style="color: #465953; background-color: #d2ebe3;">50</span>,<span style="color: #465953; background-color: #d2ebe3;">60</span><span style="color: #9c739c;">}</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">z</span>;
    <span style="color: #605a52; background-color: #f7f3ee;">int</span> <span style="color: #4c5361; background-color: #dde4f2;">found</span> = minimo<span style="color: #9c739c;">(</span>x, <span style="color: #465953; background-color: #d2ebe3;">6</span>, &amp;z<span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">if</span><span style="color: #9c739c;">(</span>found<span style="color: #9c739c;">)</span>
        printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Trovato %d"</span>, z<span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">else</span>
        printf<span style="color: #9c739c;">(</span><span style="color: #525643; background-color: #e2e9c1;">"Nessun elemento trovato"</span><span style="color: #9c739c;">)</span>;
    <span style="color: #614c61; background-color: #f1ddf1;">return</span> <span style="color: #465953; background-color: #d2ebe3;">0</span>;
<span style="color: #7382a0;">}</span>
</pre>
</div>

<pre class="example">
Trovato 40
</pre>


<p>
Nota:
</p>
<blockquote>
<p>
L’utilizzo del flag found_at_least_one per mantenere l’informazione di aver già trovato almeno un elemento che soddisfa il filtro.
</p>
</blockquote>


<p>
<a href="#sec-1">[ TOP ]​</a> <a href="ITlist.html">[ HOME ]​</a>
</p>
</div>
</div>
</div></div></div>
<footer id="postamble" class="">
<div><p class="author">Author: Jacopo Costantini</p>
<p class="date">Created: 2022-01-22 Sat 10:49</p>
<p class="creator"><a href="http://www.gnu.org/software/emacs/">Emacs</a> 28.0.91 (<a href="http://orgmode.org">Org-mode</a> 9.6)</p>
</div>
</footer>
</body>
</html>
